/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Podaj dane uwierzytelnienia";
"CONNECT_TO_SERVER" = "Połącz się z serwerem";
"PRINTER_AUTH" = "Uwierzytelnienie drukowania";
"SCREEN_SHARE_AUTH" = "Udostępnij ekran";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Podaj swoją nazwę oraz hasło, aby połączyć się z „%@”.";
"GENERIC_MSG_PASS" = "Podaj hasło, aby połączyć się z „%@”.";
"GENERIC_MSG_NONAME" = "Podaj nazwę i hasło użytkownika.";

/* Protocol Specific */
"AFP_MSG" = "Podaj nazwę użytkownika oraz hasło dla serwera „%@”.";
"SMB_MSG" = "Podaj nazwę użytkownika oraz hasło dla serwera „%@”.";
"FTP_MSG" = "Podaj nazwę użytkownika oraz hasło dla serwera „%@”.";
"WEBDAV_MSG" = "Podaj nazwę użytkownika oraz hasło dla serwera „%@”.";

/* File Server */
"FS_MSG_BOTH" = "Podaj nazwę użytkownika oraz hasło dla serwera „%@”.";
"FS_MSG_PASS" = "Podaj hasło dla serwera „%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Podaj nazwę użytkownika oraz hasło dla serwera „%@”.";
"SRV_MSG_PASS" = "Podaj hasło dla serwera „%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Podaj nazwę użytkownika oraz hasło dla drukarki „%@”.";
"PRINT_MSG_PASS" = "Podaj hasło dla drukarki „%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Podaj nazwę użytkownika oraz hasło dla serwera druku „%@”.";
"PS_MSG_PASS" = "Podaj nazwę użytkownika oraz hasło dla serwera druku „%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Aby zobaczyć ekran komputera „%@”, podaj nazwę użytkownika oraz hasło.";
"SS_MSG_PASS" = "Podaj hasło, aby współdzielić ekran użytkownika „%@”.";

"VS_MSG_BOTH" = "Podaj nazwę użytkownika oraz hasło, aby oglądać ekran użytkownika „%@”.";
"VS_MSG_PASS" = "Podaj hasło, aby oglądać ekran użytkownika „%@”.";

/* Time Machine */
"TM_MSG_BOTH" = "Podaj nazwę użytkownika i hasło dla serwera „%@”, aby Time Machine miał do niego dostęp.";
"TM_MSG_PASS" = "Podaj hasło dla serwera „%@”, aby Time Machine miał do niego dostęp.";

/* Pre Auth */
"PA_MSG_BOTH" = "Podaj nazwę użytkownika oraz hasło dostępu do serwera proxy „%@”.";
"PA_MSG_PASS" = "Podaj hasło dostępu do serwera proxy „%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Połącz";
"SHARE" = "Udostępnij";
"PRINT" = "Drukuj";
"VIEW" = "Widok";
"OK" = "OK";

"CONNECT_AS" = "Połącz się jako:";
"GUEST" = "gość";
"REGISTERED_USER" = "zarejestrowany użytkownik";

"CONNECT_BY" = "Połącz:";
"BY_ASKING_FOR_PERMISSION" = "Prosząc o zezwolenie";
"AS_REGISTERED_USER" = "Jako zarejestrowany użytkownik";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Domena\\Nazwa użytkownika";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Zaznacz woluminy „%@” do zamontowania:";
"SELECT_VOLUME" = "Zaznacz wolumin, który chcesz zamontować:";

"SELECT_PRINTER_ON_SERVER" = "Zaznacz drukarkę na „%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Zachodnie (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Zmień hasło użytkownika „%1$@” na „%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Łączę się…";
"CONNECTING_TO_HOST" = "Łączę się z „%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Podaj hasło dla „%@” na serwerze plików „%@”.";
"ENTER_VOLUME_PASSWORD" = "Podaj hasło dla „%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "hasło sieci";
"PRINT_PASSWORD" = "Hasło drukarki";
"AFP_PASSWORD" = "Hasło AFP";
"SMB_PASSWORD" = "Hasło SMB";
"FTP_PASSWORD" = "Hasło FTP";
"WEBDAV_PASSWORD" = "Hasło WebDAV";
"VNC_PASSWORD" = "Hasło VNC";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Wystąpił błąd.";
"EMSG_INVALID_PWD" = "Podane hasło jest nieprawidłowe.";
"EMSG_INVALID_NAME_PWD" = "Podana została przez Ciebie zła nazwa lub hasło użytkownika.";
"EMSG_PWD_EXPIRED" = "Hasło straciło ważność.";
"EMSG_PWD_NEEDS_CHANGE" = "Hasło musi zostać zmienione.";
"EMSG_PWD_POLICY" = "Hasło nie jest zgodne z zasadami narzucanymi przez serwer.";
"EMSG_CONNECTION_FAILED" = "Połączenie nie powiodło się";

"EMSG_MOUNT_FAILURE" = "Wolumin nie został zamontowany.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Spróbuj ponownie.";
"EINFO_CONTACT_ADMIN" = "Aby uzyskać więcej informacji, skontaktuj się z administratorem systemu.";

"EINFO_NO_ACCESS_USER" = "Nie masz uprawnień dostępu do serwera „%@”.";
"EINFO_NO_ACCESS_GUEST" = "Serwer „%@” nie zezwala na dostęp gości.";
"EINFO_SAME_MACHINE" = "Serwer „%@” uruchomiony jest na Twoim komputerze. Korzystaj z woluminów i plików lokalnie.";
"EINFO_NO_SERVER" = "Być może serwer „%@” nie istnieje lub jest w tym momencie niedostępny. Sprawdź nazwę serwera lub jego adres IP, upewnij się, że połączenie z siecią działa prawidłowo, po czym spróbuj ponownie.";
"EINFO_TOO_MANY_USERS" = "Serwer „%@” nie pozwala na zalogowanie się kolejnym użytkownikom. Spróbuj połączyć się z nim później.";
"EINFO_GENERAL" = "Wystąpił błąd podczas połączenia z serwerem „%@”. Sprawdź nazwę serwera lub adres IP i spróbuj ponownie.\n\nJeśli nie uda się rozwiązać problemu, skontaktuj się z administratorem systemu.";
"EINFO_NO_SHARES" = "Brak dostępnych udziałów lub nie masz zezwolenia na dostęp do nich na serwerze „%@”. Skontaktuj się z administratorem systemu, aby rozwiązać ten problem.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "Nie masz uprawnień dostępu do tego serwera.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Ten serwer nie zezwala na dostęp gości.";
"EINFO_SAME_MACHINE_UNKNOWN" = "Ten serwer plików jest uruchomiony na Twoim komputerze. Korzystaj z woluminów i plików lokalnie.";
"EINFO_NO_SERVER_UNKNOWN" = "Być może ten serwer nie istnieje lub jest w tym momencie niedostępny. Sprawdź nazwę serwera lub jego adres IP, upewnij się, że połączenie z siecią działa prawidłowo, po czym spróbuj ponownie.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Ten serwer plików nie pozwala na zalogowanie się kolejnym użytkownikom. Spróbuj połączyć się z nim później.";
"EINFO_GENERAL_UNKNOWN" = "Wystąpił błąd podczas połączenia z serwerem. Sprawdź nazwę serwera lub adres IP i spróbuj ponownie.\n\nJeśli nie uda się rozwiązać problemu, skontaktuj się z administratorem systemu.";
"EINFO_NO_SHARES_UNKNOWN" = "Brak dostępnych udziałów lub nie masz zezwolenia na dostęp do nich na tym serwerze. Skontaktuj się z administratorem systemu, aby rozwiązać ten problem.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Wystąpił błąd podczas zamontowania woluminu.";
"EINFO_ONE_MOUNT_FAILED" = "Woluminu „%@” nie można było zamontować.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Następujących woluminów nie udało się zamontować:";
